Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg54/edc/ATSAMG54N19.PIC
      <edc:SFRDef edc:_addr="0x40000110" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="I2SC0_RNPR" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC0">
            <edc:SFRFieldDef edc:cname="RXNPTR" edc:desc="Receive Next Pointer" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000114" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="I2SC0_RNCR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC0">
            <edc:SFRFieldDef edc:cname="RXNCTR" edc:desc="Receive Next Counter" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000118" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="I2SC0_TNPR" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC0">
            <edc:SFRFieldDef edc:cname="TXNPTR" edc:desc="Transmit Next Pointer" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000011C" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="I2SC0_TNCR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC0">
            <edc:SFRFieldDef edc:cname="TXNCTR" edc:desc="Transmit Counter Next" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000120" edc:access="-------w----wwww------ww------ww" edc:cname="I2SC0_PTCR" edc:impl="0x10F0303" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC0">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:desc="Receiver Transfer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXTDIS" edc:desc="Receiver Transfer Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:desc="Transmitter Transfer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXTDIS" edc:desc="Transmitter Transfer Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:desc="Receiver Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXCBDIS" edc:desc="Receiver Circular Buffer Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:desc="Transmitter Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBDIS" edc:desc="Transmitter Circular Buffer Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ERRCLR" edc:desc="Transfer Bus Error Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000124" edc:access="-------r-----r-r-------r-------r" edc:cname="I2SC0_PTSR" edc:impl="0x1050101" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC0">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:desc="Receiver Transfer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:desc="Transmitter Transfer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:desc="Receiver Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:desc="Transmitter Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="Transfer Bus Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000128" edc:offset="0x3ED8"/>
      <edc:SFRDef edc:_addr="0x40004000" edc:access="------------------------w-wwwwww" edc:cname="I2SC1_CR" edc:impl="0xBF" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC1">
            <edc:SFRFieldDef edc:cname="RXEN" edc:desc="Receiver Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXDIS" edc:desc="Receiver Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CKEN" edc:desc="Clocks Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CKDIS" edc:desc="Clocks Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:desc="Transmitter Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXDIS" edc:desc="Transmitter Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40004004" edc:access="nnnnnnnn--nnnnnn-nnn-nnn---nnn-n" edc:cname="I2SC1_MR" edc:impl="0xFF3F771D" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC1">
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="Inter-IC Sound Controller Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SLAVE" edc:desc="I2SCK and i2SWS pin inputs used as bit clock and word select/frame synchronization." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MASTER" edc:desc="Bit clock and word select/frame synchronization generated by I2SC from MCK and output to I2SCK and I2SWS pins. MCK is output as master clock on I2SMCK if I2SC_MR.IMCKMODE is set." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DATALENGTH" edc:desc="Data Word Length" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="_32_BITS" edc:desc="Data length is set to 32 bits" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_24_BITS" edc:desc="Data length is set to 24 bits" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_20_BITS" edc:desc="Data length is set to 20 bits" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_18_BITS" edc:desc="Data length is set to 18 bits" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_16_BITS" edc:desc="Data length is set to 16 bits" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_16_BITS_COMPACT" edc:desc="Data length is set to 16-bit compact stereo. Left sample in bits 15:0 and right sample in bits 31:16 of same word." edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_8_BITS" edc:desc="Data length is set to 8 bits" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_8_BITS_COMPACT" edc:desc="Data length is set to 8-bit compact stereo. Left sample in bits 7:0 and right sample in bits 15:8 of the same word." edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RXMONO" edc:desc="Receive Mono" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXDMA" edc:desc="Single or Multiple PDC Channels for Receiver" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXLOOP" edc:desc="Loop-back Test Mode" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXMONO" edc:desc="Transmit Mono" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXDMA" edc:desc="Single or Multiple PDC Channels for Transmitter" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSAME" edc:desc="Transmit Data when Underrun" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="IMCKDIV" edc:desc="Peripheral Clock to I2SC Master Clock Ratio" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="IMCKFS" edc:desc="Master Clock to fs Ratio" edc:nzwidth="0x6">
              <edc:SFRFieldSemantic edc:cname="M2SF16" edc:desc="Sample frequency ratio set to 16" edc:when="(field &amp; 0x3F) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="M2SF32" edc:desc="Sample frequency ratio set to 32" edc:when="(field &amp; 0x3F) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="M2SF48" edc:desc="Sample frequency ratio set to 48" edc:when="(field &amp; 0x3F) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="M2SF64" edc:desc="Sample frequency ratio set to 64" edc:when="(field &amp; 0x3F) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="M2SF96" edc:desc="Sample frequency ratio set to 96" edc:when="(field &amp; 0x3F) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="M2SF128" edc:desc="Sample frequency ratio set to 128" edc:when="(field &amp; 0x3F) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="M2SF192" edc:desc="Sample frequency ratio set to 192" edc:when="(field &amp; 0x3F) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="M2SF256" edc:desc="Sample frequency ratio set to 256" edc:when="(field &amp; 0x3F) == 0xF"/>
              <edc:SFRFieldSemantic edc:cname="M2SF384" edc:desc="Sample frequency ratio set to 384" edc:when="(field &amp; 0x3F) == 0x17"/>
              <edc:SFRFieldSemantic edc:cname="M2SF512" edc:desc="Sample frequency ratio set to 512" edc:when="(field &amp; 0x3F) == 0x1F"/>
              <edc:SFRFieldSemantic edc:cname="M2SF768" edc:desc="Sample frequency ratio set to 768" edc:when="(field &amp; 0x3F) == 0x2F"/>
              <edc:SFRFieldSemantic edc:cname="M2SF1024" edc:desc="Sample frequency ratio set to 1024" edc:when="(field &amp; 0x3F) == 0x3F"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="IMCKMODE" edc:desc="Master Clock Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IWS" edc:desc="I2SWS TDM Slot Width" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40004008" edc:access="r---------rrr---------rrrrrrrrrr" edc:cname="I2SC1_SR" edc:impl="0x803803FF" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC1">
            <edc:SFRFieldDef edc:cname="RXEN" edc:desc="Receiver Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receive Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of Receiver Transfer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:desc="Transmitter Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmit Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXUR" edc:desc="Transmit Underrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:desc="End of Transmitter Transfer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXORCH" edc:desc="Receive Overrun Channel" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Receive Buffer Full" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXURCH" edc:desc="Transmit Underrun Channel" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:desc="Transmit Buffer Empty" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000400C" edc:access="----------ww----------ww-w---w--" edc:cname="I2SC1_SCR" edc:impl="0x300344" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC1">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXOR" edc:desc="Receive Overrun Status Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TXUR" edc:desc="Transmit Underrun Status Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXORCH" edc:desc="Receive Overrun Per Channel Status Clear" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="TXURCH" edc:desc="Transmit Underrun Per Channel Status Clear" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
