Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg54/edc/ATSAMG54N19.PIC
      <edc:SFRDef edc:_addr="0x4001C124" edc:access="-------r-----r-r-------r-------r" edc:cname="TWI1_PTSR" edc:impl="0x1050101" edc:nzwidth="0x20" ltx:memberofperipheral="TWI1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI1">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:desc="Receiver Transfer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:desc="Transmitter Transfer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:desc="Receiver Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:desc="Transmitter Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="Transfer Bus Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4001C128" edc:offset="0x7ED8"/>
      <edc:SFRDef edc:_addr="0x40024000" edc:access="------------ww--w--wwwwwwwwwww--" edc:cname="US_CR" edc:impl="0xC9FFC" edc:nzwidth="0x20" ltx:memberofperipheral="USART">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RSTRX" edc:desc="Reset Receiver" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTTX" edc:desc="Reset Transmitter" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXEN" edc:desc="Receiver Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXDIS" edc:desc="Receiver Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:desc="Transmitter Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXDIS" edc:desc="Transmitter Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTSTA" edc:desc="Reset Status Bits" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STTBRK" edc:desc="Start Break" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STPBRK" edc:desc="Stop Break" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STTTO" edc:desc="Clear TIMEOUT Flag and Start Time-out After Next Character Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SENDA" edc:desc="Send Address" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RETTO" edc:desc="Start Time-out Immediately" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FCS" edc:desc="Force SPI Chip Select" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCS" edc:desc="Release SPI Chip Select" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024004" edc:access="---n-------nnnnnnnnnnnnnnnnnnnnn" edc:cname="US_MR" edc:impl="0x101FFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART">
            <edc:SFRFieldDef edc:cname="USART_MODE" edc:desc="USART Mode of Operation" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal mode" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="RS485" edc:desc="RS485 mode" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="HW_HANDSHAKING" edc:desc="Hardware Handshaking" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SPI_MASTER" edc:desc="SPI master mode" edc:when="(field &amp; 0xF) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="SPI_SLAVE" edc:desc="SPI Slave mode" edc:when="(field &amp; 0xF) == 0xF"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="USCLKS" edc:desc="Clock Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Peripheral clock is selected" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Peripheral clock divided (DIV=8) is selected" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SCK" edc:desc="Serial clock (SCK) is selected" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CHRL" edc:desc="Character Length" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_5_BIT" edc:desc="Character length is 5 bits" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_6_BIT" edc:desc="Character length is 6 bits" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_7_BIT" edc:desc="Character length is 7 bits" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_8_BIT" edc:desc="Character length is 8 bits" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CPHA" edc:desc="SPI Clock Phase" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PAR" edc:desc="Parity Type" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="EVEN" edc:desc="Even parity" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ODD" edc:desc="Odd parity" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SPACE" edc:desc="Parity forced to 0 (Space)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MARK" edc:desc="Parity forced to 1 (Mark)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No parity" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="MULTIDROP" edc:desc="Multidrop mode" edc:when="(field &amp; 0x7) == 0x6"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NBSTOP" edc:desc="Number of Stop Bits" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_1_BIT" edc:desc="1 stop bit" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_5_BIT" edc:desc="1.5 stop bits (SYNC = 0) or reserved (SYNC = 1)" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BIT" edc:desc="2 stop bits" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CHMODE" edc:desc="Channel Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal mode" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="AUTOMATIC" edc:desc="Automatic Echo. Receiver input is connected to the TXD pin." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="LOCAL_LOOPBACK" edc:desc="Local Loopback. Transmitter output is connected to the Receiver Input." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="REMOTE_LOOPBACK" edc:desc="Remote Loopback. RXD pin is internally connected to the TXD pin." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CPOL" edc:desc="SPI Clock Polarity" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE9" edc:desc="9-bit Character Length" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKO" edc:desc="Clock Output Select" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVER" edc:desc="Oversampling Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WRDBT" edc:desc="Wait Read Data Before Transfer" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="FILTER" edc:desc="Receive Line Filter" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024008" edc:access="------------w------wwwwwwwwwwwww" edc:cname="US_IER" edc:impl="0x81FFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="RXRDY Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="TXRDY Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:desc="Receiver Break Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of Receive Buffer Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:desc="End of Transmit Buffer Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:desc="Framing Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:desc="Parity Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Time-out Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="TXEMPTY Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="SPI Underrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:desc="Transmit Buffer Empty Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Receive Buffer Full Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:desc="Clear to Send Input Change Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002400C" edc:access="------------w------wwwwwwwwwwwww" edc:cname="US_IDR" edc:impl="0x81FFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="RXRDY Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="TXRDY Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:desc="Receiver Break Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of Receive Buffer Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:desc="End of Transmit Buffer Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:desc="Framing Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:desc="Parity Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Time-out Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="TXEMPTY Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="SPI Underrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:desc="Transmit Buffer Empty Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Receive Buffer Full Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:desc="Clear to Send Input Change Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024010" edc:access="------------r------rrrrrrrrrrrrr" edc:cname="US_IMR" edc:impl="0x81FFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="RXRDY Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="TXRDY Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:desc="Receiver Break Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of Receive Buffer Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:desc="End of Transmit Buffer Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:desc="Framing Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:desc="Parity Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Time-out Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="TXEMPTY Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="SPI Underrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:desc="Transmit Buffer Empty Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Receive Buffer Full Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:desc="Clear to Send Input Change Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024014" edc:access="--------r---r------rrrrrrrrrrrrr" edc:cname="US_CSR" edc:impl="0x881FFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receiver Ready (cleared by reading US_RHR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmitter Ready (cleared by writing US_THR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:desc="Break Received/End of Break (cleared by writing a one to bit US_CR.RSTSTA)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of RX Buffer (cleared by writing US_RCR or US_RNCR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:desc="End of TX Buffer (cleared by writing US_TCR or US_TNCR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error (cleared by writing a one to bit US_CR.RSTSTA)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:desc="Framing Error (cleared by writing a one to bit US_CR.RSTSTA)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:desc="Parity Error (cleared by writing a one to bit US_CR.RSTSTA)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Receiver Time-out (cleared by writing a one to bit US_CR.STTTO)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="Transmitter Empty (cleared by writing US_THR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:desc="Underrun Error (cleared by writing a one to bit US_CR.RSTSTA)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:desc="TX Buffer Empty (cleared by writing US_TCR or US_TNCR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="RX Buffer Full (cleared by writing US_RCR or US_RNCR)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:desc="Clear to Send Input Change Flag (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTS" edc:desc="Image of CTS Input" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024018" edc:access="----------------r------rrrrrrrrr" edc:cname="US_RHR" edc:impl="0x81FF" edc:nzwidth="0x20" ltx:memberofperipheral="USART">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART">
            <edc:SFRFieldDef edc:cname="RXCHR" edc:desc="Received Character" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RXSYNH" edc:desc="Received Sync" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002401C" edc:access="----------------w------wwwwwwwww" edc:cname="US_THR" edc:impl="0x81FF" edc:nzwidth="0x20" ltx:memberofperipheral="USART">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART">
            <edc:SFRFieldDef edc:cname="TXCHR" edc:desc="Character to be Transmitted" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TXSYNH" edc:desc="Sync Field to be Transmitted" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
