Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg54/edc/ATSAMG54N19.PIC
      <edc:AdjustPoint edc:_addr="0x40030060" edc:offset="0x84"/>
      <edc:SFRDef edc:_addr="0x400300E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="PDMIC1_WPMR" edc:impl="0xFFFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="PDMIC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC1">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protect Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x414443"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400300E8" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:cname="PDMIC1_WPSR" edc:impl="0xFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="PDMIC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC1">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400300EC" edc:offset="0x14"/>
      <edc:SFRDef edc:_addr="0x40030100" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PDMIC1_RPR" edc:nzwidth="0x20" ltx:memberofperipheral="PDMIC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC1">
            <edc:SFRFieldDef edc:cname="RXPTR" edc:desc="Receive Pointer Register" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40030104" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PDMIC1_RCR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PDMIC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC1">
            <edc:SFRFieldDef edc:cname="RXCTR" edc:desc="Receive Counter Register" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40030108" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x40030110" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PDMIC1_RNPR" edc:nzwidth="0x20" ltx:memberofperipheral="PDMIC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC1">
            <edc:SFRFieldDef edc:cname="RXNPTR" edc:desc="Receive Next Pointer" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40030114" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PDMIC1_RNCR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PDMIC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC1">
            <edc:SFRFieldDef edc:cname="RXNCTR" edc:desc="Receive Next Counter" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40030118" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x40030120" edc:access="-------w----wwww------ww------ww" edc:cname="PDMIC1_PTCR" edc:impl="0x10F0303" edc:nzwidth="0x20" ltx:memberofperipheral="PDMIC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC1">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:desc="Receiver Transfer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXTDIS" edc:desc="Receiver Transfer Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:desc="Transmitter Transfer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXTDIS" edc:desc="Transmitter Transfer Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:desc="Receiver Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXCBDIS" edc:desc="Receiver Circular Buffer Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:desc="Transmitter Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBDIS" edc:desc="Transmitter Circular Buffer Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ERRCLR" edc:desc="Transfer Bus Error Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40030124" edc:access="-------r-----r-r-------r-------r" edc:cname="PDMIC1_PTSR" edc:impl="0x1050101" edc:nzwidth="0x20" ltx:memberofperipheral="PDMIC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC1">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:desc="Receiver Transfer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:desc="Transmitter Transfer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:desc="Receiver Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:desc="Transmitter Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="Transfer Bus Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40030128" edc:offset="0x7ED8"/>
      <edc:SFRDef edc:_addr="0x40038000" edc:access="---------------------------ww-ww" edc:cname="ADC_CR" edc:impl="0x1B" edc:nzwidth="0x20" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="START" edc:desc="Start Conversion" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="AUTOCAL" edc:desc="Automatic Calibration of ADC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPRST" edc:desc="Comparison Restart" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038004" edc:access="nnnnnnnn-n--nnnnnnnnnnnnn-nnnnnn" edc:cname="ADC_MR" edc:impl="0xFF4FFFBF" edc:nzwidth="0x20" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="TRGEN" edc:desc="Trigger Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Hardware triggers are disabled. Starting a conversion is only possible by software." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="Hardware trigger selected by TRGSEL field is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TRGSEL" edc:desc="Trigger Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="ADC_TRIG0" edc:desc="External trigger" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ADC_TRIG1" edc:desc="TIO Output of the Timer Counter Channel 0" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="ADC_TRIG2" edc:desc="TIO Output of the Timer Counter Channel 1" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ADC_TRIG3" edc:desc="TIO Output of the Timer Counter Channel 2" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="ADC_TRIG4" edc:desc="RTCOUT0" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="ADC_TRIG5" edc:desc="RTTINC" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LOWRES" edc:desc="Resolution" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="BITS_10" edc:desc="10-bit resolution. For higher resolution by averaging, please refer to &quot;ADC Extended Mode Register&quot; on page 77." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="BITS_8" edc:desc="8-bit resolution" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SLEEP" edc:desc="Sleep Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal Mode: The ADC core and reference voltage circuitry are kept ON between conversions." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SLEEP" edc:desc="Sleep Mode: The ADC core and reference voltage circuitry are OFF between conversions." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FREERUN" edc:desc="Free Run Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Normal Mode" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Free Run Mode: Never wait for any trigger." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PRESCAL" edc:desc="Prescaler Rate Selection" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STARTUP" edc:desc="Start Up Time" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="SUT0" edc:desc="0 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SUT8" edc:desc="8 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SUT16" edc:desc="16 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SUT24" edc:desc="24 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="SUT64" edc:desc="64 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="SUT80" edc:desc="80 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="SUT96" edc:desc="96 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="SUT112" edc:desc="112 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="SUT512" edc:desc="512 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="SUT576" edc:desc="576 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="SUT640" edc:desc="640 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="SUT704" edc:desc="704 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="SUT768" edc:desc="768 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0xC"/>
              <edc:SFRFieldSemantic edc:cname="SUT832" edc:desc="832 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0xD"/>
              <edc:SFRFieldSemantic edc:cname="SUT896" edc:desc="896 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="SUT960" edc:desc="960 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0xF"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DIV1" edc:desc="ADC Clock Prescaler Division forced to 1" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO_DIV1" edc:desc="The PRESCAL field is used to generate the ADC clock unless DIV3 is written to 1." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="FORCE_DIV1" edc:desc="The ADC clock equals peripheral clock (PRESCAL and DIV3 fields have no effect)." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TRACKTIM" edc:desc="Tracking Time" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="TRANSFER" edc:desc="Transfer Period" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="DIV3" edc:desc="ADC Clock Prescaler Division forced to 3" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO_DIV3" edc:desc="The PRESCAL field is used to generate the ADC clock unless DIV1 is written to 1." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="FORCE_DIV3" edc:desc="The ADC clock equals peripheral clock/3 unless DIV1 is written to 1." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="USEQ" edc:desc="Use Sequence Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NUM_ORDER" edc:desc="Normal Mode: The controller converts channels in a simple numeric order depending only on the channel index." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="REG_ORDER" edc:desc="User Sequence Mode: The sequence respects what is defined in ADC_SEQR1 register and can be used to convert the same channel several times." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038008" edc:access="----nnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADC_SEQR1" edc:impl="0xFFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="USCH1" edc:desc="User Sequence Number 1" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH2" edc:desc="User Sequence Number 2" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH3" edc:desc="User Sequence Number 3" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH4" edc:desc="User Sequence Number 4" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH5" edc:desc="User Sequence Number 5" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH6" edc:desc="User Sequence Number 6" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH7" edc:desc="User Sequence Number 7" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4003800C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x40038010" edc:access="------------------------wwwwwwww" edc:cname="ADC_CHER" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="CH0" edc:desc="Channel 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:desc="Channel 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH2" edc:desc="Channel 2 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH3" edc:desc="Channel 3 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH4" edc:desc="Channel 4 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH5" edc:desc="Channel 5 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH6" edc:desc="Channel 6 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH7" edc:desc="Channel 7 Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038014" edc:access="------------------------wwwwwwww" edc:cname="ADC_CHDR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="CH0" edc:desc="Channel 0 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:desc="Channel 1 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH2" edc:desc="Channel 2 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH3" edc:desc="Channel 3 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH4" edc:desc="Channel 4 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH5" edc:desc="Channel 5 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH6" edc:desc="Channel 6 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH7" edc:desc="Channel 7 Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
