Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg54/edc/ATSAMG54N19.PIC
      <edc:SFRDef edc:_addr="0x40038018" edc:access="------------------------rrrrrrrr" edc:cname="ADC_CHSR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="CH0" edc:desc="Channel 0 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:desc="Channel 1 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH2" edc:desc="Channel 2 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH3" edc:desc="Channel 3 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH4" edc:desc="Channel 4 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH5" edc:desc="Channel 5 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH6" edc:desc="Channel 6 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH7" edc:desc="Channel 7 Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4003801C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x40038020" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="ADC_LCDR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="LDATA" edc:desc="Last Data Converted" edc:nzwidth="0xC"/>
            <edc:SFRFieldDef edc:cname="CHNB" edc:desc="Channel Number" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038024" edc:access="---wwwwww---w-----------wwwwwwww" edc:cname="ADC_IER" edc:impl="0x1F8800FF" edc:nzwidth="0x20" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="EOC0" edc:desc="End of Conversion Interrupt Enable 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:desc="End of Conversion Interrupt Enable 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:desc="End of Conversion Interrupt Enable 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:desc="End of Conversion Interrupt Enable 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:desc="End of Conversion Interrupt Enable 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:desc="End of Conversion Interrupt Enable 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:desc="End of Conversion Interrupt Enable 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:desc="End of Conversion Interrupt Enable 7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="LCCHG" edc:desc="Last Channel Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EOCAL" edc:desc="End of Calibration Sequence" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:desc="General Overrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:desc="Comparison Event Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of Receive Buffer Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Receive Buffer Full Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038028" edc:access="---wwwwww---w-----------wwwwwwww" edc:cname="ADC_IDR" edc:impl="0x1F8800FF" edc:nzwidth="0x20" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="EOC0" edc:desc="End of Conversion Interrupt Disable 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:desc="End of Conversion Interrupt Disable 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:desc="End of Conversion Interrupt Disable 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:desc="End of Conversion Interrupt Disable 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:desc="End of Conversion Interrupt Disable 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:desc="End of Conversion Interrupt Disable 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:desc="End of Conversion Interrupt Disable 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:desc="End of Conversion Interrupt Disable 7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="LCCHG" edc:desc="Last Channel Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EOCAL" edc:desc="End of Calibration Sequence" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:desc="General Overrun Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:desc="Comparison Event Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of Receive Buffer Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Receive Buffer Full Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003802C" edc:access="---rrrrrr---r-----------rrrrrrrr" edc:cname="ADC_IMR" edc:impl="0x1F8800FF" edc:nzwidth="0x20" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="EOC0" edc:desc="End of Conversion Interrupt Mask 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:desc="End of Conversion Interrupt Mask 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:desc="End of Conversion Interrupt Mask 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:desc="End of Conversion Interrupt Mask 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:desc="End of Conversion Interrupt Mask 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:desc="End of Conversion Interrupt Mask 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:desc="End of Conversion Interrupt Mask 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:desc="End of Conversion Interrupt Mask 7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="LCCHG" edc:desc="Last Channel Change Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EOCAL" edc:desc="End of Calibration Sequence" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Ready Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:desc="General Overrun Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:desc="Comparison Event Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of Receive Buffer Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Receive Buffer Full Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038030" edc:access="---rrrrrr---r-----------rrrrrrrr" edc:cname="ADC_ISR" edc:impl="0x1F8800FF" edc:nzwidth="0x20" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="EOC0" edc:desc="End of Conversion 0 (automatically set / cleared)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:desc="End of Conversion 1 (automatically set / cleared)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:desc="End of Conversion 2 (automatically set / cleared)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:desc="End of Conversion 3 (automatically set / cleared)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:desc="End of Conversion 4 (automatically set / cleared)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:desc="End of Conversion 5 (automatically set / cleared)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:desc="End of Conversion 6 (automatically set / cleared)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:desc="End of Conversion 7 (automatically set / cleared)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="LCCHG" edc:desc="Last Channel Change (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EOCAL" edc:desc="End of Calibration Sequence" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Ready (automatically set / cleared)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:desc="General Overrun Error (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:desc="Comparison Event (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:desc="End of Receive Transfer (cleared by writing ADC_RCR or ADC_RNCR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:desc="Receive Buffer Full (cleared by writing ADC_RCR or ADC_RNCR)" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038034" edc:access="--------------------------nn---n" edc:cname="ADC_LCTMR" edc:impl="0x31" edc:nzwidth="0x20" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="DUALTRIG" edc:desc="Dual Trigger ON" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CMPMOD" edc:desc="Last Channel Comparison Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Generates an event when the converted data is lower than the low threshold of the window." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Generates an event when the converted data is higher than the high threshold of the window." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="Generates an event when the converted data is in the comparison window." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="Generates an event when the converted data is out of the comparison window." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038038" edc:access="----nnnnnnnnnnnn----nnnnnnnnnnnn" edc:cname="ADC_LCCWR" edc:impl="0xFFF0FFF" edc:nzwidth="0x20" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="LOWTHRES" edc:desc="Low Threshold" edc:nzwidth="0xC"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="HIGHTHRES" edc:desc="High Threshold" edc:nzwidth="0xC"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003803C" edc:access="------------------------rrrrrrrr" edc:cname="ADC_OVER" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="ADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="OVRE0" edc:desc="Overrun Error 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE1" edc:desc="Overrun Error 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE2" edc:desc="Overrun Error 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE3" edc:desc="Overrun Error 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE4" edc:desc="Overrun Error 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE5" edc:desc="Overrun Error 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE6" edc:desc="Overrun Error 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRE7" edc:desc="Overrun Error 7" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
