Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg54/edc/ATSAMG54N19.PIC
      <edc:SFRDef edc:_addr="0x400E0908" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="UART1_TPR" edc:nzwidth="0x20" ltx:memberofperipheral="UART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="TXPTR" edc:desc="Transmit Counter Register" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E090C" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="UART1_TCR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="UART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="TXCTR" edc:desc="Transmit Counter Register" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0910" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="UART1_RNPR" edc:nzwidth="0x20" ltx:memberofperipheral="UART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="RXNPTR" edc:desc="Receive Next Pointer" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0914" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="UART1_RNCR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="UART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="RXNCTR" edc:desc="Receive Next Counter" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0918" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="UART1_TNPR" edc:nzwidth="0x20" ltx:memberofperipheral="UART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="TXNPTR" edc:desc="Transmit Next Pointer" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E091C" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="UART1_TNCR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="UART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="TXNCTR" edc:desc="Transmit Counter Next" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0920" edc:access="-------w----wwww------ww------ww" edc:cname="UART1_PTCR" edc:impl="0x10F0303" edc:nzwidth="0x20" ltx:memberofperipheral="UART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:desc="Receiver Transfer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXTDIS" edc:desc="Receiver Transfer Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:desc="Transmitter Transfer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXTDIS" edc:desc="Transmitter Transfer Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:desc="Receiver Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXCBDIS" edc:desc="Receiver Circular Buffer Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:desc="Transmitter Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBDIS" edc:desc="Transmitter Circular Buffer Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ERRCLR" edc:desc="Transfer Bus Error Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0924" edc:access="-------r-----r-r-------r-------r" edc:cname="UART1_PTSR" edc:impl="0x1050101" edc:nzwidth="0x20" ltx:memberofperipheral="UART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:desc="Receiver Transfer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:desc="Transmitter Transfer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:desc="Receiver Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:desc="Transmitter Circular Buffer Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="Transfer Bus Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E0928" edc:offset="0xD8"/>
      <edc:SFRDef edc:_addr="0x400E0A00" edc:access="-----n-n-------n----nnnn-------n" edc:cname="EEFC_FMR" edc:impl="0x5010F01" edc:nzwidth="0x20" ltx:memberofperipheral="EFC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EFC">
            <edc:SFRFieldDef edc:cname="FRDY" edc:desc="Flash Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="FWS" edc:desc="Flash Wait State" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SCOD" edc:desc="Sequential Code Optimization Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="FAM" edc:desc="Flash Access Mode" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CLOE" edc:desc="Code Loop Optimization Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
