Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg54/edc/ATSAMG54N19.PIC
      <edc:AdjustPoint edc:_addr="0x400E141C" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x400E1424" edc:access="------------------------rrrrr---" edc:cname="SUPC_SR" edc:impl="0xF8" edc:nzwidth="0x20" ltx:memberofperipheral="SUPC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="BODRSTS" edc:desc="Brownout Detector Reset Status (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No core brownout rising edge event has been detected since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one brownout output rising edge event has been detected since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SMRSTS" edc:desc="Supply Monitor Reset Status (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No supply monitor detection has generated a core reset since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one supply monitor detection has generated a core reset since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SMS" edc:desc="Supply Monitor Status (cleared on read)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No supply monitor detection since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one supply monitor detection since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SMOS" edc:desc="Supply Monitor Output Status" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="The supply monitor detected VDDIO higher than its threshold at its last measurement." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="The supply monitor detected VDDIO lower than its threshold at its last measurement." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="OSCSEL" edc:desc="32-kHz Oscillator Selection Status" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="RC" edc:desc="The slow clock SLCK is generated by the embedded 32 kHz RC oscillator." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CRYST" edc:desc="The slow clock SLCK is generated by the 32 kHz crystal oscillator." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E1428" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x400E1430" edc:access="-------n---n-nnnnnnnnnnnnnnnnnnn" edc:cname="RTT_MR" edc:impl="0x117FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="RTT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTT">
            <edc:SFRFieldDef edc:cname="RTPRES" edc:desc="Real-time Timer Prescaler Value" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="ALMIEN" edc:desc="Alarm Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTTINCIEN" edc:desc="Real-time Timer Increment Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTTRST" edc:desc="Real-time Timer Restart" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RTTDIS" edc:desc="Real-time Timer Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RTC1HZ" edc:desc="Real-Time Clock 1Hz Clock Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1434" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RTT_AR" edc:nzwidth="0x20" ltx:memberofperipheral="RTT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTT">
            <edc:SFRFieldDef edc:cname="ALMV" edc:desc="Alarm Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1438" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="RTT_VR" edc:nzwidth="0x20" ltx:memberofperipheral="RTT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTT">
            <edc:SFRFieldDef edc:cname="CRTV" edc:desc="Current Real-time Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E143C" edc:access="------------------------------rr" edc:cname="RTT_SR" edc:impl="0x3" edc:nzwidth="0x20" ltx:memberofperipheral="RTT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTT">
            <edc:SFRFieldDef edc:cname="ALMS" edc:desc="Real-time Alarm Status (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTTINC" edc:desc="Prescaler Roll-over Status (cleared on read)" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E1440" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x400E1450" edc:access="wwwwwwww-----------------------w" edc:cname="WDT_CR" edc:impl="0xFF000001" edc:nzwidth="0x20" ltx:memberofperipheral="WDT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="WDT">
            <edc:SFRFieldDef edc:cname="WDRSTT" edc:desc="Watchdog Restart" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x17"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:desc="Password." edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation." edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1454" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="WDT_MR" edc:impl="0x3FFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="WDT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="WDT">
            <edc:SFRFieldDef edc:cname="WDV" edc:desc="Watchdog Counter Value" edc:nzwidth="0xC"/>
            <edc:SFRFieldDef edc:cname="WDFIEN" edc:desc="Watchdog Fault Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDRSTEN" edc:desc="Watchdog Reset Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDRPROC" edc:desc="Watchdog Reset Processor" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDDIS" edc:desc="Watchdog Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDD" edc:desc="Watchdog Delta Value" edc:nzwidth="0xC"/>
            <edc:SFRFieldDef edc:cname="WDDBGHLT" edc:desc="Watchdog Debug Halt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDIDLEHLT" edc:desc="Watchdog Idle Halt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
