Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg54/edc/ATSAMG54N19.PIC
      <edc:SFRDef edc:_addr="0x400E1484" edc:access="--------------------------wwwwww" edc:cname="RTC_IDR" edc:impl="0x3F" edc:nzwidth="0x20" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="ACKDIS" edc:desc="Acknowledge Update Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ALRDIS" edc:desc="Alarm Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SECDIS" edc:desc="Second Event Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMDIS" edc:desc="Time Event Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CALDIS" edc:desc="Calendar Event Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TDERRDIS" edc:desc="Time and/or Date Error Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1488" edc:access="--------------------------rrrrrr" edc:cname="RTC_IMR" edc:impl="0x3F" edc:nzwidth="0x20" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="ACK" edc:desc="Acknowledge Update Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ALR" edc:desc="Alarm Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SEC" edc:desc="Second Event Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIM" edc:desc="Time Event Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAL" edc:desc="Calendar Event Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TDERR" edc:desc="Time and/or Date Error Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E148C" edc:access="----------------------------rrrr" edc:cname="RTC_VER" edc:impl="0xF" edc:nzwidth="0x20" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="NVTIM" edc:desc="Non-valid Time" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVCAL" edc:desc="Non-valid Calendar" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVTIMALR" edc:desc="Non-valid Time Alarm" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVCALALR" edc:desc="Non-valid Calendar Alarm" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1490" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SYS_GPBR0" edc:nzwidth="0x20" ltx:memberofperipheral="GPBR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPBR">
            <edc:SFRFieldDef edc:cname="GPBR_VALUE" edc:desc="Value of GPBR x" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1494" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SYS_GPBR1" edc:nzwidth="0x20" ltx:memberofperipheral="GPBR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPBR">
            <edc:SFRFieldDef edc:cname="GPBR_VALUE" edc:desc="Value of GPBR x" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1498" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SYS_GPBR2" edc:nzwidth="0x20" ltx:memberofperipheral="GPBR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPBR">
            <edc:SFRFieldDef edc:cname="GPBR_VALUE" edc:desc="Value of GPBR x" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E149C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SYS_GPBR3" edc:nzwidth="0x20" ltx:memberofperipheral="GPBR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPBR">
            <edc:SFRFieldDef edc:cname="GPBR_VALUE" edc:desc="Value of GPBR x" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E14A0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SYS_GPBR4" edc:nzwidth="0x20" ltx:memberofperipheral="GPBR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPBR">
            <edc:SFRFieldDef edc:cname="GPBR_VALUE" edc:desc="Value of GPBR x" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E14A4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SYS_GPBR5" edc:nzwidth="0x20" ltx:memberofperipheral="GPBR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPBR">
            <edc:SFRFieldDef edc:cname="GPBR_VALUE" edc:desc="Value of GPBR x" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E14A8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SYS_GPBR6" edc:nzwidth="0x20" ltx:memberofperipheral="GPBR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPBR">
            <edc:SFRFieldDef edc:cname="GPBR_VALUE" edc:desc="Value of GPBR x" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E14AC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SYS_GPBR7" edc:nzwidth="0x20" ltx:memberofperipheral="GPBR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPBR">
            <edc:SFRFieldDef edc:cname="GPBR_VALUE" edc:desc="Value of GPBR x" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0xE0000000" edc:endaddr="0xE000EF04" edc:regionid="SYSTEM">
      <edc:AdjustPoint edc:_addr="0xE0000000" edc:offset="0xE004"/>
      <edc:SFRDef edc:_addr="0xE000E004" edc:access="----------------------------rrrr" edc:cname="ICTR" edc:desc="Interrupt Controller Type Register" edc:impl="0xF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INTLINESNUM" edc:desc="Number of interrupt lines supported by NVIC in granularities of 32." edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
