Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg54/edc/ATSAMG54N19.PIC
      <edc:SFRDef edc:_addr="0xE000ED2C" edc:access="nn----------------------------n-" edc:cname="HFSR" edc:impl="0xC0000002" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SystemControl">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VECTTBL" edc:desc="no description available" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="no BusFault on vector table read" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="BusFault on vector table read" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1C"/>
            <edc:SFRFieldDef edc:cname="FORCED" edc:desc="no description available" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="no forced HardFault" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="forced HardFault" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DEBUGEVT" edc:desc="no description available" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED30" edc:access="---------------------------nnnnn" edc:cname="DFSR" edc:impl="0x1F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SystemControl">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="HALTED" edc:desc="no description available" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="No active halt request debug event" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Halt request debug event active" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BKPT" edc:desc="no description available" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="No current breakpoint debug event" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="At least one current breakpoint debug event" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DWTTRAP" edc:desc="no description available" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="No current debug events generated by the DWT" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="At least one current debug event generated by the DWT" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="VCATCH" edc:desc="no description available" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="No Vector catch triggered" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Vector catch triggered" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EXTERNAL" edc:desc="no description available" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="No EDBGRQ debug event" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="EDBGRQ debug event" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED34" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MMFAR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SystemControl">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="ADDRESS" edc:desc="Address of MemManage fault location" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED38" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BFAR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SystemControl">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="ADDRESS" edc:desc="Address of the BusFault location" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED3C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="AFSR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SystemControl">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="AUXFAULT" edc:desc="Latched version of the AUXFAULT inputs" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000ED40" edc:offset="0x50"/>
      <edc:SFRDef edc:_addr="0xE000ED90" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:cname="MPU_TYPE" edc:impl="0xFFFF01" edc:mclr="00000000000000000000100000000000" edc:nzwidth="0x20" edc:por="00000000000000000000100000000000" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="SEPARATE" edc:desc="Indicates support for unified or separate instruction and date memory maps." edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DREGION" edc:desc="Indicates the number of supported MPU instruction regions." edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="IREGION" edc:desc="Indicates the number of supported MPU data regions." edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED94" edc:access="-----------------------------nnn" edc:cname="MPU_CTRL" edc:impl="0x7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enables the MPU" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HFNMIENA" edc:desc="Enables the operation of MPU during hard fault, NMI, and FAULTMASK handlers." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRIVDEFENA" edc:desc="Enables privileged software access to the default memory map." edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED98" edc:access="------------------------nnnnnnnn" edc:cname="MPU_RNR" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="REGION" edc:desc="Indicates the MPU region referenced by the MPU_RBAR and MPU_RASR registers." edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
