Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.3.42/samg54/edc/ATSAMG54N19.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="TEST"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDOUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDOUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="JTAGSEL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
